Revit 2027 API
Generic.GenericRefractionIndex Property
 The property labeled "Refraction" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericRefractionIndex { get; }
Public Shared ReadOnly Property GenericRefractionIndex As String
	Get
public:
static property String^ GenericRefractionIndex {
	String^ get ();
}
static member GenericRefractionIndex : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0.01, 5".
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace